app/controllers/posts_controller.rb

  def update
    @post = Post.find(params[:id])

    if @post.update(params[:post].permit(:title, :text))
---
SELECT "posts".* FROM "posts" WHERE "posts"."id" = ? LIMIT 1  [["id", "1"]]
UPDATE "posts" SET "title" = ?, "updated_at" = ? WHERE "posts"."id" = 1  [["title", ":(:(:(:("], ["updated_at", Wed, 23 Apr 2014 19:48:15 UTC +00:00]]